tap 'caskroom/cask'
tap 'railwaycat/emacsmacport'
tap 'daviderestivo/emacs-head'
cask_args appdir: "~/Applications", require_sha: true

brew 'wget'
brew 'coreutils'
brew 'zsh'
brew 'tmux'
brew 'rbenv'
brew 'pyenv'
brew 'goenv'
brew 'jq'
brew 'awscli'
brew 'mysql'
brew 'nodebrew'
brew 'reattach-to-user-namespace'
brew 'pandoc'
brew 'tig'
brew 'docker'
brew 'gpg'
brew 'w3m'
brew 'wget'
brew 'curl'
brew 'sbt'
brew 'watch' 
brew 'cabal-install'
brew 'flyway'
brew 'ghc'
brew 'circleci'
brew 'emacs-head@28 --with-cocoa --with-imagemagick --with-native-comp'
brew 'rustup'
brew 'valgrind'
brew 'rtags'
brew 'direnv'
brew 'fontforge'

cask 'alfred'
cask 'appcleaner'
cask 'caffeine'
cask 'chromium'
cask 'clipmenu'
cask 'cyberduck'
cask 'docker'
cask 'doxygen'
cask 'firefox'
cask 'font-dejavu-sans'
cask 'font-dejavu-sans-mono-for-powerline'
cask 'fork'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'google-cloud-sdk'
cask 'google-japanese-ime'
cask 'hex-fiend'
cask 'iterm2'
cask 'karabiner-elements'
cask 'mysqlworkbench'
cask 'shiftit'
cask 'vagrant'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'wkhtmltopdf'
cask 'slack'
cask 'sketch'
